import random
'''
此处运用随机函数产生随机蔬菜，保证新增蔬菜唯一
'''
def random_cai():
    #xing = ("红萝卜西红柿大白菜小平菇金针菇紫包菜杏鲍菇青辣椒四季豆绿豆芽黄豆芽西兰花雪里红大白菜")
    xing =['苹果', '沙和尚果', '海棠', '野樱莓', '枇杷', '欧楂', '山楂', '梨', '温柏', '蔷薇果', '花楸', '杏', '樱桃', '水蜜桃', '油桃',
          '蟠桃', '李子', '梅子', '青梅', '西梅', '白玉樱桃', '黑果莓', '云莓', '罗甘莓', '白里叶莓', '柑果', '橘子', '砂糖丑桔', '罗田橙子',
          '瘦腰柠檬', '青裹柠', '刺柚子', '金抢桔', '葡萄果柚', '香田橼', '千佛手', '指手橙', '黄皮果', '超爽橘子', '砂糖桔', '橙子', '柠檬',
          '青柠', '柚子', '金桔', '葡萄柚', '香橼', '佛手', '指橙', '黄皮果','香蕉', '大蕉', '南洋红香蕉', '葡萄', '提子', '醋栗', '黑醋栗',
          '红醋栗', '蓝田莓', '蔓越莓', '越橘', '乌饭果', '猕猴桃', '奇异果', '黄心猕猴桃', '软枣猕猴', '奇异莓', '红心猕猴桃', '菠萝', '凤梨',
          '杨梅', '柿子', '黑枣', '君迁子', '黑柿', '宝安桑', '桑椹', '无花果', '菠萝蜜', '构树果', '牛奶果', '火龙果', '黄龙果',
          '红心龙果', '仙人掌果', '荔枝', '龙眼', '桂圆', '红毛丹', '榴莲', '猴面包果', '椰子', '槟榔', '海枣', '枸杞', '香瓜茄', '人参果',
          '灯笼果', '圣女果', '小番茄', '大力菠菜', '甜白菜', '农家芹菜', '红胡萝卜', '小茴香', '芫荽', '木兰番茄', '肥头茄子', '辣椒',
          '紫色黄瓜', '西葫芦', '西头南瓜', '芜菁', '白菜', '甘蓝', '洪山芥菜', '四季豆', '豌豆', '胡豆', '毛豆', '土豆', '黄豆芽', '绿豆芽',
          '豆芽', '甘蓝菜', '包心菜', '大白菜', '小白菜', '水白菜', '西洋菜', '通心菜', '潺菜', '花椰菜', '西兰花', '空心菜', '金针菜', '芥菜',
          '芹菜', '蒿菜', '甜菜', '紫菜', '生菜', '菠菜', '韭菜', '香菜', '发菜', '榨菜', '雪里红', '莴苣', '芦笋', '竹笋', '笋干',
          '韭黄', '白萝卜', '胡萝卜', '荸荠', '菜瓜', '丝瓜', '水瓜', '南瓜', '苦瓜', '黄瓜', '青瓜', '付子瓜', '冬瓜', '小黄瓜', '山芋',
          '芋头', '百叶', '香菇', '草菇', '金针菇', '蘑菇', '冬菇', '姬菇', '萍菇', '圣女小番茄', '番茄', '茄子', '马铃薯', '莲藕', '木耳',
          '白木耳', '生姜', '仔姜', '洋姜', '荞头', '大蒜', '蒜头', '小葱', '大葱', '洋葱', '青葱', '青椒', '大红椒', '小红椒', '红尖椒',
          '圆椒', '长茄子', '太空茄子', '草莓', '蓝莓', '黑莓', '桑葚', '覆盆子', '葡萄蜜瓜', '美人青提', '乌鲁红提', '紫色葡萄', '马奶子',
          '广西柑橘', '宜昌蜜橘', '会砂糖橘', '上等金橘', '山西蜜柑', '荆州甜橙', '湖南脐橙', '西藏西柚', '紫葡萄柚', '新西柠檬', '文旦',
          '莱姆核果', '美人桃', '美味油桃', '蟠桃', '上海蜜桃', '太远黄桃', '江陵李子', '美国樱桃', '孔融杏', '酸酸梅子', '韶关杨梅', '广州西梅',
          '海南乌梅', '新疆大枣', '河南沙枣', '青海枣', '恩施蜜枣', '黄冈橄榄', '泰国荔枝', '槟榔果类', '嘎啦苹果', '红富士', '红星', '国光',
          '秦冠', '黄元帅', '沙和尚梨', '好砂糖梨', '黄金梨', '莱阳梨', '本地香梨', '乌兰雪梨', '香蕉梨', '公安蛇果', '海棠果', '沙果',
          '中山柿子', '康乐山竹', '特黑布林', '紫色枇杷', '蓝色杨桃', '红色山楂', '高圣女果', '新无花果', '河南白果', '开罗汉果', '越火龙果',
          '白猕猴桃', '美人西瓜', '美人冬瓜', '特别甜瓜', '极品香瓜', '黄河优蜜', '长哈密瓜', '红色木瓜', '乳瓜', '通山菠萝', '榆次芒果',
          '太原栗子', '大头椰子', '特奇异果', '芭乐', '无毛榴莲', '有孔香蕉', '荷塘甘蔗', '蓝色百合', '补血莲子', '无糖石榴', '特硬核桃', '拐枣']
    ming = ("ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz")
    #ming = ("红萝卜西红柿大白菜小平菇金针菇紫包菜杏鲍菇青辣椒四季豆绿豆芽黄豆芽西兰花雪里红大白菜")
    X = random.choice(xing)
   # X = "".join(random.choice(ming) for j in range(2))
    M = "".join(random.choice(ming) for i in range(2))
    N = str(random.randint(1,9))
    key = X + M + N
    return key

